app/views/trips/index.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 2]]
---
  <% if current_user %>
    <% current_user.trips.each do |trip| %>