app/views/objectives/_form.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 2]]
---
  <div>
    <%= f.collection_select :trip_id, current_user.trips.all, :id, :title %>