app/controllers/objectives_controller.rb

INSERT INTO "objectives" ("title", "city", "country", "state", "trip_id") VALUES (?, ?, ?, ?, ?)  [["title", "this obje"], ["city", "nyc"], ["country", "USA"], ["state", "ny"], ["trip_id", 3]]
---
  def create
    @objective = Objective.create(objective_params)

SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @objective = Objective.find(params[:id])

SELECT  "objectives".* FROM "objectives" WHERE "objectives"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "objectives" SET "title" = ?, "notes" = ? WHERE "objectives"."id" = ?  [["title", "this statue of liberty"], ["notes", "Bring some shades"], ["id", 2]]
---
  def update
    @objective = @trip.objectives.find(params[:id])

    if @objective.update(objective_params)