app/controllers/trips_controller.rb

  def index
    if current_user
      @trips = current_user.trips
      respond_to do |format|
        format.html { render :show }
        format.json { render json: @trips, root: true}
      end
      redirect_to '/trips/new' if @trips.blank?
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 2]]

  def show
    @locations = []
    @sortedObjectives = []
    @states           = []

    @trip.locations.map {|location| @locations << {lat: location.lat,lng: location.lng} if location.lat || location.lng }.compact
    @sortedObjectives = @trip.objectives.sort_by {|objective| objective.location[:state]}

    # every duplicate state will be nil
    @sortedObjectives.each do |objective|
---
SELECT "objectives".* FROM "objectives" WHERE "objectives"."trip_id" = ?  [["trip_id", 3]]

  def create
    @trip      = Trip.create(title: trip_params["title"], description: trip_params["description"])
---
INSERT INTO "trips" ("title") VALUES (?)  [["title", "new triddip"]]

  def update
    if @trip.update(trip_params)
---
UPDATE "trips" SET "description" = ? WHERE "trips"."id" = ?  [["description", "I can't wait to go on this triddidip!!"], ["id", 3]]

    def set_trip
      @trip = Trip.find(params[:id])
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]